# 最大公约数计算。获得2个整数，求出这两个整数的“最大公约数”和“最小公倍数”。
"""
辗转相除法：

（1）比较两数，并使m>n

（2）将m作被除数，n做除数，相除后余数为r

（3）循环判断r，若r==0，则n为最大公约数，结束循环。若r ！=0 ，执行m=n，n=r；将m作被除数，n做除数，相除后余数为r
"""
print("不知道小数求最大公约数和最小公倍数合不合理，但……我能求(•̀ᴗ•́)و ̑̑")
num_1 = eval(input("请输入第一个数："))
num_2 = eval(input("请输入第二个数："))

m = max(num_1, num_2)
n = min(num_1, num_2)

rem = m % n  # 求余数

while rem != 0 :  # 只要除不尽
    m = n  # 令“大”=“小”
    n = rem  # 令“小”=“余”
    rem = m % n  # 再求余数
print(num_1, "和", num_2, "的最大公约数是", n)
LCM = num_1 * num_2 / n
print(num_1, "和", num_2, "的最小公倍数是", LCM)
