"""
Turtle 绘图题：同心圆
类型：Turtle 绘图‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬

参照代码模板完善代码，实现下述功能，不得修改其它代码。‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬

使用 turtle 库的函数，绘制三个彩色的圆，圆的颜色按顺序从颜色列表 color 中获取；圆的半径从里至外分别是 20、50、100。效果如下图所示。‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬

img‪‬‪‬‪‬‪‬‪‬‮‬‫‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬

注意：本题不支持在线评测，不需要提交程序。请自己参考讲解，利用本地IDLE完善代码，修正错误，调试至正确代码。最后的考试成绩评分里，本题按照满分计算。
"""

# 在_____处填写一行代码
# 在….处填写多行代码

import turtle as t

color = ['red','pink','green']
r = [20, 50, 100]
for i in range(3):
    t.pu()
    t.goto(0, -r[i])
    t.pd()
    t.pencolor(color[i])
    t.circle(r[i])
t.done()
